CS/C.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>C语言</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="C语言"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-03-21T16:05+0800"/>
<meta name="author" content="ChrisChen"/>
<meta name="description" content=""/>
<meta name="keywords" content="C"/>
<link rel="stylesheet" href="../css/stylesheet.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:100%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>


<div id="content">
<h1 class="title">C语言</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 windows下编译环境</a>
<ul>
<li><a href="#sec-1-1">1.1 cl.exe</a></li>
<li><a href="#sec-1-2">1.2 无法找到mspdb80.dll</a></li>
<li><a href="#sec-1-3">1.3 cannot open file "kernel32.lib"</a></li>
<li><a href="#sec-1-4">1.4 编译</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Hello World</a>
<ul>
<li><a href="#sec-2-1">2.1 字符格式化</a></li>
<li><a href="#sec-2-2">2.2 char</a></li>
</ul>
</li>
<li><a href="#sec-3">3 类型、运算符与表达式</a>
<ul>
<li><a href="#sec-3-1">3.1 const符号</a></li>
<li><a href="#sec-3-2">3.2 char</a></li>
<li><a href="#sec-3-3">3.3 signed和unsigned关键字</a></li>
<li><a href="#sec-3-4">3.4 bool值</a></li>
<li><a href="#sec-3-5">3.5 float</a></li>
<li><a href="#sec-3-6">3.6 关于函数参数的转换</a></li>
<li><a href="#sec-3-7">3.7 位操作符</a></li>
<li><a href="#sec-3-8">3.8 条件语句</a></li>
</ul>
</li>
<li><a href="#sec-4">4 标准库</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> windows下编译环境</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> cl.exe</h3>
<div class="outline-text-3" id="text-1-1">


<p class="verse">
将cl.exe所在目录加入系统变量[PATH]<br/>
C:/Program Files/Microsoft Visual Studio 9.0/VC/bin<br/>
</p>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 无法找到mspdb80.dll</h3>
<div class="outline-text-3" id="text-1-2">

<p>方法：
</p><ol>
<li>从Common7/IDE/下复制"msobj80.dll,mspdb80.dll,mspdbcore.dll,mspdbsrv.exe"到VC/Bin/下即可解决
</li>
<li>添加系统变量PAT：C:/Program Files/Microsoft Visual Studio 9.0/Common7/IDE
</li>
</ol>

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> cannot open file "kernel32.lib"</h3>
<div class="outline-text-3" id="text-1-3">


<p class="verse">
设置系统变量：<br/>
（LIB）C:\Program Files\Microsoft SDKs\Windows\v6.0A\Lib;D:\Program Files\Microsoft Visual Studio 9.0\VC\lib<br/>
（INCLUDE）D:\Program Files\Microsoft Visual Studio 9.0\VC\include<br/>
</p>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 编译</h3>
<div class="outline-text-3" id="text-1-4">


</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> 编译前运行vcvars32.bat</h4>
<div class="outline-text-4" id="text-1-4-1">

<p>D:\Program Files\Microsoft Visual Studio 9.0\VC\bin\vcvars32.bat
</p></div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Hello World</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 字符格式化</h3>
<div class="outline-text-3" id="text-2-1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">格式</th><th scope="col" class="left">说明</th></tr>
</thead>
<tbody>
<tr><td class="left">%3d</td><td class="left">表示打印6位整型</td></tr>
<tr><td class="left">%ld</td><td class="left">长整型</td></tr>
<tr><td class="left">%6.1f</td><td class="left">打印6位浮点型，".1"表示保留一位小数</td></tr>
<tr><td class="left">%f</td><td class="left">表示float和double</td></tr>
<tr><td class="left">%.0f</td><td class="left">表示不打印小数点和小数部分</td></tr>
<tr><td class="left">%s</td><td class="left">对应的字符串末尾必须有'\0'</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> char</h3>
<div class="outline-text-3" id="text-2-2">


<p class="verse">
单引号中的字符表示一个整型值。<br/>
ASCII码中：'9'-'0' = 9<br/>
char数组表示一个字符串，末尾需加上'\0'表示字符串结尾<br/>
</p>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 类型、运算符与表达式</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> const符号</h3>
<div class="outline-text-3" id="text-3-1">

<p>const限定的数组表示其所有元素的值都不能被修改。参数前使用表示函数体内不能修改。
</p></div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> char</h3>
<div class="outline-text-3" id="text-3-2">


<p class="verse">
char转换成int时，根据机器不同，可能出现负值。C定义保证了标准打印字符集中的字符不会是负值。<br/>
保持可移植性的做法是：在存储非字符数据时，最好指定signed或unsigned。<br/>
</p>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> signed和unsigned关键字</h3>
<div class="outline-text-3" id="text-3-3">


<p class="verse">
仅声明signed和unsigned的情况，默认都是int类型：<br/>
signed   -&gt;  signed int <br/>
unsigned  -&gt; unsigned int<br/>
</p>


</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> bool值</h3>
<div class="outline-text-3" id="text-3-4">


<p class="verse">
true为非0，false为0<br/>
&amp;&amp;、||等逻辑运算，判定为真时表达式值为1<br/>
</p>


</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> float</h3>
<div class="outline-text-3" id="text-3-5">

<p>一般用于：
</p><ol>
<li>为了在使用较大的数组时节省存储空间
</li>
<li>有时为了节省机器执行(双精度运算特别耗时)
</li>
</ol>

</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 关于函数参数的转换</h3>
<div class="outline-text-3" id="text-3-6">


<p class="verse">
在没有函数原型的情况下，char与short类型将被转换为int，<br/>
float将被转换为double。<br/>
</p>


</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> 位操作符</h3>
<div class="outline-text-3" id="text-3-7">

<ul>
<li>"&amp;"经常用于屏蔽某些位

<p>
   例： n = n &amp; 0177 只保留了最后7位(0177=1111111)
</p></li>
<li>"|"经常用于将某些位赋为1

<p>
   例：一个set包含4位，0000为全关状态，set1 = 0100, set2 = 1000, set = set1 | set2即set中的两个开关被打开
</p></li>
<li>"&lt;&lt;" 左移n位，移入的新位赋予0。左移n位相当于乘以\(2^n\)
</li>
<li>"&gt;&gt;" 右移


<p class="verse">
右移一个unsigned整数，移入的新位总是赋予0值。<br/>
<br/>
右移signed整数的话，有些机器上采用算术移位(arithmetic shift)，使用符号位填补。<br/>
还有一些机器上采用逻辑移位，移入的新位赋予0值。<br/>
</p>




<pre class="example">1001 0101 &gt;&gt; 2
结果：
逻辑移位： 0010 0101
算术移位： 1110 0101
</pre>


<p class="verse">
关于signed整数内存中存储形式的补充。<br/>
第一位为符号位，负数为1，正数为0。符号位后几位与对应的正数每一位取反。<br/>
</p>




<pre class="example">123   01111011
-123  10000100
</pre>

</li>
<li>"~"取反



<pre class="example">x = x &amp; ~077 //077:11 1111 语句效果：将x最后六位设为0
</pre>

<p>
  x &amp; ~077要比 x &amp; 0177700的效果好，后者假定了x是一个16-bits数，移植性不好。
</p></li>
<li>"^"异或操作
  常用于：^0 保留原位  ^1取补，等同于"~"操作
</li>
</ul>


</div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> 条件语句</h3>
<div class="outline-text-3" id="text-3-8">

<p>f为浮点型，n为整型。
</p>


<pre class="src src-c">(n &gt; 0) ? f : n
</pre>


<p class="verse">
该语句无论n是否大于0，返回的是float型。<br/>
浮点型相对于整形来说，是一个更大的数。<br/>
所以n &lt; 0时，会对n作隐形转换转成浮点型，再返回。<br/>
</p>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 标准库</h2>
<div class="outline-text-2" id="text-4">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">库名</th><th scope="col" class="left">说明</th></tr>
</thead>
<tbody>
<tr><td class="left">limits.h</td><td class="left">与机器和编译器有关的属性定义</td></tr>
<tr><td class="left">float.h</td><td class="left">同上</td></tr>
<tr><td class="left">ctype.h</td><td class="left">定义了一组与字符集无关的转换函数</td></tr>
<tr><td class="left">math.h</td><td class="left">数学函数集，一般使用双精度类型的变量。</td></tr>
</tbody>
</table>

</div>
</div>
</div>

</body>
</html>
